---
type: RebarShapeConstraintProjectedSegmentLength
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# RebarShapeConstraintProjectedSegmentLength

`Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintProjectedSegmentLength | 2012 | `public RebarShapeConstraintProjectedSegmentLength ( ElementId paramId , UV direction , int tripleProductSign , RebarShapeSegmentEndReferenceType refType0 , RebarShapeSegmentEndReferenceType refType1 )` |
| Method | GetSegmentEndReferenceType | 2012 | `public RebarShapeSegmentEndReferenceType GetSegmentEndReferenceType ( int index )` |
| Property | Direction | 2012 | `public UV Direction { get ; }` |
| Property | TripleProductSign | 2012 | `public int TripleProductSign { get ; }` |